cask_args appdir: '/Applications'

## Packages
brew 'awscli'
brew 'bitrise'
brew 'colordiff'
brew 'direnv'
brew 'ghq'
brew 'git'
# for zsh-git-prompt
brew 'haskell-stack'
brew 'ios-sim'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'neovim'
brew 'nodebrew'
brew 'peco'
brew 'reattach-to-user-namespace'
brew 'rbenv'
brew 'rbenv-communal-gems'
brew 'ruby'
brew 'ruby-build'
brew 'terminal-notifier'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'watchman'
brew 'wget'
brew 'zsh'

### Heroku
tap 'heroku/brew'
brew 'heroku/brew/heroku'

### plantuml
cask 'java'
brew 'plantuml'

## .dmg, .pkg
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'android-file-transfer'
cask 'android-studio'
cask 'atom'
cask 'aquaskk'
cask 'bartender'
cask 'bettertouchtool'
cask 'bowtie'
cask 'caffeine'
cask 'ccleaner'
cask 'clipy'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'duet'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'growlnotify'
cask 'gyazo'
cask 'istat-menus'
cask 'iterm2'
cask 'ivolume'
cask 'karabiner-elements'
cask 'kindle'
cask 'lastfm'
cask 'omnifocus'
cask 'omnioutliner'
cask 'omnipresence'
cask 'opera'
cask 'react-native-debugger'
cask 'rescuetime'
cask 'sequel-pro'
cask 'sketch'
cask 'skitch'
cask 'slack'
cask 'the-unarchiver'
cask 'typora'
cask 'vimr'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'zeplin'

### cask for Google Chrome Canary
tap 'homebrew/cask-versions'
cask 'google-chrome-canary'

### cask for Kensington TrackballWorks
tap 'homebrew/cask-drivers'
cask 'kensington-trackball-works'

### cask for MacVim Kaoriya
tap 'delphinus/macvim-kaoriya'
cask 'macvim-kaoriya'

### cask for powerline fonts
tap 'homebrew/cask-fonts'
cask 'font-source-code-pro-for-powerline'

### cask for React Native
cask 'java10'
cask 'java8'

## App Store
mas 'Day One', id: 1055511498
mas 'Divvy', id: 413857545
mas 'GIPHY CAPTURE', id: 668208984
mas 'Growl', id: 467939042
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'LINE', id: 539883307
mas 'Microsoft Remote Desktop', id: 715768417
mas 'MindNode', id: 1289197285
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'Speed-Up', id: 412356892
mas 'TogglDesktop', id: 957734279
mas 'Tweetbot', id: 1384080005
mas 'WhiteNoise', id: 415139197
mas 'WinArchiver Lite', id: 414855915
mas 'Xcode', id: 497799835
