cask_args appdir: '/Applications'

## Packages
brew 'awscli'
brew 'bitrise'
brew 'colordiff'
brew 'deno'
brew 'direnv'
brew 'ghq'
brew 'git'
brew 'go'
brew 'ios-sim'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'neovim'
brew 'nvm'
brew 'peco'
brew 'pyenv'
brew 'python'
brew 'rbenv'
brew 'rbenv-communal-gems'
brew 'ruby'
brew 'ruby-build'
# for powerline fonts
brew 'svn'
brew 'terminal-notifier'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'watchman'
brew 'wget'
brew 'zinit'
brew 'zsh'

### Heroku
tap 'heroku/brew'
brew 'heroku/brew/heroku'

### plantuml
brew 'plantuml'

### React Native
tap 'facebook/fb'
brew 'idb-companion'

## .dmg, .pkg
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'appcleaner'
cask 'android-file-transfer'
cask 'android-studio'
cask 'atom'
cask 'aquaskk'
cask 'bartender'
cask 'bettertouchtool'
cask 'choosy'
cask 'clipy'
cask 'dash'
cask 'discord'
cask 'displaylink'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'fantastical'
cask 'figma'
cask 'firefox'
cask 'flipper'
cask 'google-chrome'
cask 'gyazo'
cask 'istat-menus'
cask 'iterm2'
cask 'ivolume'
cask 'karabiner-elements'
cask 'kindle'
cask 'maccy'
cask 'moom'
cask 'react-native-debugger'
cask 'ngrok'
cask 'notion'
cask 'omnifocus'
cask 'omnioutliner'
cask 'omnipresence'
cask 'postman'
cask 'raindropio'
cask 'rescuetime'
cask 'sketch'
cask 'slack'
cask 'stay'
cask 'the-unarchiver'
cask 'typora'
cask 'vimr'
cask 'visual-studio-code'
cask 'witch'
cask 'xcodes'
cask 'zoom'

### cask for Google Chrome Canary
tap 'homebrew/cask-versions'
cask 'google-chrome-canary'

### cask for KensingtonWorks, ScanSnap Home, Caldigit, Logicool
tap 'homebrew/cask-drivers'
cask 'fujitsu-scansnap-home'
cask 'kensingtonworks'
cask 'caldigit-docking-utility'
cask 'logitech-g-hub'

### cask for powerline fonts
tap 'homebrew/cask-fonts'
cask 'font-source-code-pro-for-powerline'
cask 'font-fira-code'
cask 'font-cica'

### cask for React Native
cask 'zulu11'
tap 'acebook/fb'
brew 'idb-companion'

## App Store
mas 'Amphetamine', id: 937984704
mas 'Day One', id: 1055511498
mas 'EasyRes', id: 688211836
mas 'GIPHY CAPTURE', id: 668208984
mas 'iMovie', id: 408981434
mas 'Habitify', id: 1111447047
mas 'Just Focus', id: 1142151959
mas 'Keynote', id: 409183694
mas 'LINE', id: 539883307
mas 'MindNode', id: 1289197285
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'Scrobbles for Last.fm', id: 1344679160
mas 'Speedtest', id: 1153157709
mas 'Speed-Up', id: 412356892
mas 'TestFlight', id: 899247664
mas 'Toggl Track', id: 957734279
mas 'WhiteNoise', id: 415139197
mas 'WinArchiver Lite', id: 414855915
mas 'Xcode', id: 497799835
